app/Controllers/BrandController.php

    public function edit($id)
    {
        helper('form');
        $brandModel = new BrandModel();
        $brands = $brandModel->select('id, b_name')->where('id', $id)->first();
---
SELECT `id`, `b_name`
FROM `brands`
WHERE `id` = '2'
 LIMIT 1