app/Controllers/ProductController.php

    public function edit($id)
    {
        $productModel = new ProductModel();
        $Products = $productModel->select('id,p_name,m_no')->where('id', $id)->first();
---
SELECT `id`, `p_name`, `m_no`
FROM `products`
WHERE `id` = '31'
 LIMIT 1