app/Controllers/UserController.php

    public function edit($id)
    {
        helper('form');
        $userModel = new User();
        $user = $userModel->select('id, f_name, l_name, email, salery')->where('id', $id)->first();
---
SELECT `id`, `f_name`, `l_name`, `email`, `salery`
FROM `users`
WHERE `id` = '11'
 LIMIT 1