app/Controllers/UserController.php

    public function index()
    {
        $userModel = new User();
        $users = $userModel->select('id, f_name, l_name, email, salery')->findAll();
---
SELECT `id`, `f_name`, `l_name`, `email`, `salery`
FROM `users`

    public function edit($id)
    {
        helper('form');
        $userModel = new User();
        $user = $userModel->select('id, f_name, l_name, email, salery')->where('id', $id)->first();
---
SELECT `id`, `f_name`, `l_name`, `email`, `salery`
FROM `users`
WHERE `id` = '1'
 LIMIT 1

                        return redirect()->to('/');
                    }
                } else {
                    $userModel->update($id, [
                        'f_name' => $this->request->getPost('f_name'),
                        'l_name' => $this->request->getPost('l_name'),
                        'salery' => $this->request->getPost('salery'),
                    ]);
---
UPDATE `users` SET `f_name` = 'Sandipan', `l_name` = 'Chatterjee', `salery` = '3.00', `updated_at` = '2023-05-01 13:40:07'
WHERE `users`.`id` IN ('1')

    public function delete($id)
    {
        $userModel = new User();
        $userModel->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('2')