app/Models/BrandModel.php

    public function editBrand($id, $data)
    {
        return $this->update($id, $data);
---
UPDATE `brands` SET `b_name` = ' Aurelia', `updated_at` = '2023-05-10 13:41:41'
WHERE `brands`.`id` IN ('2')