app/Models/ProductModel.php

    public function editProduct($id, $data)
    {
        return $this->update($id, $data);
---
UPDATE `products` SET `p_name` = 'Printed Salwar Suit', `m_no` = '22', `updated_at` = '2023-05-10 13:45:30'
WHERE `products`.`id` IN ('31')